In [1]:
import pandas as pd

In [75]:
s=pd.Series([10,20,30])

In [76]:
print(s)

0    10
1    20
2    30
dtype: int64

In [77]:
s.dtype

dtype('int64')

In [78]:
s.values

array([10, 20, 30])

In [79]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
s.name="numbers"

:

In [81]:
#indexing
s[0]

np.int64(10)

In [82]:
s[0]

np.int64(10)

In [83]:
s[0:2]#staert(included):stop(excluded)

0    10
1    20
Name: numbers, dtype: int64

In [84]:
s.iloc[2]

np.int64(30)

In [85]:
s.iloc[[0,1,2]]

0    10
1    20
2    30
Name: numbers, dtype: int64

In [86]:
index=["apple","banana","grapes","orange","strawberry"]

In [87]:
p=pd.Series([100,455,300,400,600])

In [88]:
p.name="calories"

In [89]:
p.index=index

In [90]:
print(p)

apple         100
banana        455
grapes        300
orange        400
strawberry    600
Name: calories, dtype: int64

In [91]:
p['grapes']

np.int64(300)

In [92]:
p.iloc[2] #iloc=label based index

np.int64(300)

In [93]:
fruit_protein={
    "Avocado":2.0,
    "Guava":2.6,
    "BLackberry":2.0,
    "Oranges":0.9,
    "Banana":1.1,
    "Apples":0.3,
    "kiwi":1.1,
    "pomegranate":1.7,
    "Mango":0.8,
    "Cherries":1.0
}

In [94]:
s02=pd.Series(fruit_protein,name="Protein")
s02

Avocado        2.0
Guava          2.6
BLackberry     2.0
Oranges        0.9
Banana         1.1
Apples         0.3
kiwi           1.1
pomegranate    1.7
Mango          0.8
Cherries       1.0
Name: Protein, dtype: float64

In [95]:
#conditional selection
s02[s02>1]

Avocado        2.0
Guava          2.6
BLackberry     2.0
Banana         1.1
kiwi           1.1
pomegranate    1.7
Name: Protein, dtype: float64

In [96]:
#logical operators:And,or,Not
s02[(s02>.5) & (s02<=2)]

Avocado        2.0
BLackberry     2.0
Oranges        0.9
Banana         1.1
kiwi           1.1
pomegranate    1.7
Mango          0.8
Cherries       1.0
Name: Protein, dtype: float64

In [97]:
s02[~(s02<1)]

Avocado        2.0
Guava          2.6
BLackberry     2.0
Banana         1.1
kiwi           1.1
pomegranate    1.7
Cherries       1.0
Name: Protein, dtype: float64

In [138]:
data={
    "Name":["Alice","Bob","Charlie","David","Eve"],
    "Age":[25,30,np.nan,29,25],
    "Department":["HR","IT","FINANCE","HR","HR"],
    "Salary":[50000,60000,62000,np.nan,50000]
    
}

In [139]:
data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
 'Age': [25, 30, nan, 29, 25],
 'Department': ['HR', 'IT', 'FINANCE', 'HR', 'HR'],
 'Salary': [50000, 60000, 62000, nan, 50000]}

In [140]:
df=pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie   NaN    FINANCE  62000.0
3    David  29.0         HR      NaN
4      Eve  25.0         HR  50000.0

In [141]:
df.tail(3)

      Name   Age Department   Salary
2  Charlie   NaN    FINANCE  62000.0
3    David  29.0         HR      NaN
4      Eve  25.0         HR  50000.0

In [142]:
df.loc[1:3,["Age","Department"]]

    Age Department
1  30.0         IT
2   NaN    FINANCE
3  29.0         HR

In [143]:
df.iloc[1:3,:3]#rows,col

      Name   Age Department
1      Bob  30.0         IT
2  Charlie   NaN    FINANCE

In [144]:
df.shape

(5, 4)

In [145]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Age         4 non-null      float64
 2   Department  5 non-null      object
 3   Salary      4 non-null      float64
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes

In [148]:
#broadcasting
df["Salary"==df["Salary"]+5000]
df["Salary"]

0    50000.0
1    60000.0
2    62000.0
3        NaN
4    50000.0
Name: Salary, dtype: float64